desfly/secyr/firmware/esp-idf/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_BROWNOUT_DET=y

CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_COMPILER_STACK_CHECK_MODE_ALL=y

CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# HomeGuard Bluetooth transport. Peripheral role serves the Android app;
# central role is reserved for bound BLE key-fob profile adapters.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3

# Bench-test safety profile: do not enable HMAC-backed NVS encryption until
# the production eFuse allocation has been verified on the target module.
# Provisioning secret writes are blocked in software while NVS encryption is off.

CONFIG_LWIP_LOCAL_HOSTNAME="homeguard-s3"
# Advertise DHCP option 114 while the factory setup AP is active. Android and
# iOS can then open the local setup page without treating the no-Internet AP as
# a dead network. The runtime URI is http://192.168.4.1.
CONFIG_ESP_ENABLE_DHCP_CAPTIVEPORTAL=y
# Explicit descriptor budget: HTTPD keeps 3 internal sockets in addition to its
# client sessions, while mDNS, device discovery, DNS and MQTT also need sockets.
# ESP-IDF's lwIP default of 10 is too small for a normal browser asset burst.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_MDNS_MAX_INTERFACES=3

CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256
CONFIG_HTTPD_WS_SUPPORT=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_FS_LOCK=8

CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
